[
  [
    {
      "ArtNo": "0",
      "Name": "PREAMBLE",
      "ArtDesc": "WE, THE PEOPLE OF INDIA, having solemnly resolved to constitute India into a SOVEREIGN SOCIALIST SECULAR DEMOCRATIC REPUBLIC and to secure to all its citizens:\nJUSTICE, social, economic and political;\nLIBERTY of thought, expression, belief, faith and worship;\nEQUALITY of status and of opportunity;\nand to promote among them all\nFRATERNITY assuring the dignity of the individual and the unity and integrity of the Nation;\nIN OUR CONSTITUENT ASSEMBLY this twenty-sixth day of November, 1949, do HEREBY ADOPT, ENACT AND GIVE TO OURSELVES THIS CONSTITUTION."
    },
    {
      "ArtNo": "1",
      "Name": "Name and territory of the Union.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "India, that is Bharat, shall be a Union of States."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "The States and the territories thereof shall be as specified in the First Schedule."
        },
        {
          "ClauseNo": "3",
          "ClauseDesc": "The territory of India shall comprise",
          "SubClauses": [
            {
              "SubClauseNo": "a",
              "SubClauseDesc": "the territories of the States;"
            },
            {
              "SubClauseNo": "b",
              "SubClauseDesc": "the Union territories specified in the First Schedule; and"
            },
            {
              "SubClauseNo": "c",
              "SubClauseDesc": "such other territories as may be acquired."
            }
          ]
        }
      ]
    },
    {
      "ArtNo": "2",
      "Name": "Admission or establishment of new States.",
      "ArtDesc": "Parliament may by law admit into the Union, or establish, new States on such terms and conditions as it thinks fit."
    },
    {
      "ArtNo": "2A",
      "Name": "Sikkim to be associated with the Union",
      "ArtDesc": "Sikkim to be associated with the Union. Omitted by the Constitution",
      "Status": "Omitted"
    },
    {
      "ArtNo": "3",
      "Name": "Formation of new States and alteration of areas, boundaries or names of existing States.",
      "ArtDesc": "Parliament may by law—\n(a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State;\n(b) increase the area of any State;\n(c) diminish the area of any State;\n(d) alter the boundaries of any State;\n(e) alter the name of any State:\nProvided that no Bill for the purpose shall be introduced in either House of Parliament except on the recommendation of the President and unless, where the proposal contained in the Bill affects the area, boundaries or name of any of the States, the Bill has been referred by the President to the Legislature of that State for expressing its views thereon within such period as may be specified in the reference or within such further period as the President may allow and the period so specified or allowed has expired.",
      "Explanations": [
        {
          "ExplanationNo": "1",
          "Explanation": "In this article, in clauses (a) to (e), \"State\" includes a Union territory, but in the proviso, \"State\" does not include a Union territory."
        },
        {
          "ExplanationNo": "2",
          "Explanation": "The power conferred on Parliament by clause (a) includes the power to form a new State or Union territory by uniting a part of any State or Union territory to any other State or Union territory."
        }
      ]
    },
    {
      "ArtNo": "4",
      "Name": "Laws made under articles 2 and 3 to provide for the amendment of the First and the Fourth Schedules and supplemental, incidental and consequential matters.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "Any law referred to in article 2 or article 3 shall contain such provisions for the amendment of the First Schedule and the Fourth Schedule as may be necessary to give effect to the provisions of the law and may also contain such supplemental, incidental and consequential provisions (including provisions as to representation in Parliament and in the Legislature or Legislatures of the State or States affected by such law) as Parliament may deem necessary."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "No such law as aforesaid shall be deemed to be an amendment of this Constitution for the purposes of article 368."
        }
      ]
    },
    {
      "ArtNo": "5",
      "Name": "Citizenship at the commencement of the Constitution.",
      "ArtDesc": "At the commencement of this Constitution, every person who has his domicile in the territory of India and—\n(a) who was born in the territory of India; or\n(b) either of whose parents was born in the territory of India; or\n(c) who has been ordinarily resident in the territory of India for not less than five years immediately preceding such commencement,\nshall be a citizen of India."
    },
    {
      "ArtNo": "6",
      "Name": "Rights of citizenship of certain persons who have migrated to India from Pakistan.",
      "ArtDesc": "Notwithstanding anything in article 5, a person who has migrated to the territory of India from the territory now included in Pakistan shall be deemed to be a citizen of India at the commencement of this Constitution if—\n(a) he or either of his parents or any of his grand-parents was born in India as defined in the Government of India Act, 1935 (as originally enacted); and\n(b) (i) in the case where such person has so migrated before the nineteenth day of July, 1948, he has been ordinarily resident in the territory of India since the date of his migration, or\n(ii) in the case where such person has so migrated on or after the nineteenth day of July, 1948, he has been registered as a citizen of India by an officer appointed in that behalf by the Government of the Dominion of India on an application made by him therefor to such officer before the commencement of this Constitution in the form and manner prescribed by that Government:\nProvided that no person shall be so registered unless he has been resident in the territory of India for at least six months immediately preceding the date of his application."
    },
    {
      "ArtNo": "7",
      "Name": "Rights of citizenship of certain migrants to Pakistan.",
      "ArtDesc": "Notwithstanding anything in articles 5 and 6, a person who has after the first day of March, 1947, migrated from the territory of India to the territory now included in Pakistan shall not be deemed to be a citizen of India:\nProvided that nothing in this article shall apply to a person who, after having so migrated to the territory now included in Pakistan, has returned to the territory of India under a permit for resettlement or permanent return issued by or under the authority of any law and every such person shall for the purposes of clause (b) of article 6 be deemed to have migrated to the territory of India after the nineteenth day of July, 1948."
    },
    {
      "ArtNo": "8",
      "Name": "Rights of citizenship of certain persons of Indian origin residing outside India.",
      "ArtDesc": "Notwithstanding anything in article 5, any person who or either of whose parents or any of whose grandparents was born in India as defined in the Government of India Act, 1935 (as originally enacted), and who is ordinarily residing in any country outside India as so defined shall be deemed to be a citizen of India if he has been registered as a citizen of India by the diplomatic or consular representative of India in the country where he is for the time being residing on an application made by him therefor to such diplomatic or consular representative, whether before or after the commencement of this Constitution, in the form and manner prescribed by the Government of the Dominion of India or the Government of India."
    },
    {
      "ArtNo": "9",
      "Name": "Persons voluntarily acquiring citizenship of a foreign State not to be citizens.",
      "ArtDesc": "No person shall be a citizen of India by virtue of article 5, or be deemed to be a citizen of India by virtue of article 6 or article 8, if he has voluntarily acquired the citizenship of any foreign State."
    },
    {
      "ArtNo": "10",
      "Name": "Continuance of the rights of citizenship.",
      "ArtDesc": "Every person who is or is deemed to be a citizen of India under any of the foregoing provisions of this Part shall, subject to the provisions of any law that may be made by Parliament, continue to be such citizen."
    },
    {
      "ArtNo": "11",
      "Name": "Parliament to regulate the right of citizenship by law.",
      "ArtDesc": "Nothing in the foregoing provisions of this Part shall derogate from the power of Parliament to make any provision with respect to the acquisition and termination of citizenship and all other matters relating to citizenship."
    },
    {
      "ArtNo": "12",
      "Name": "Definition.",
      "AKA": "General",
      "ArtDesc": "In this Part, unless the context otherwise requires, \"the State\" includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India."
    },
    {
      "ArtNo": "13",
      "Name": "Laws inconsistent with or in derogation of the fundamental rights.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "All laws in force in the territory of India immediately before the commencement of this Constitution, in so far as they are inconsistent with the provisions of this Part, shall, to the extent of such inconsistency, be void."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "The State shall not make any law which takes away or abridges the rights conferred by this Part and any law made in contravention of this clause shall, to the extent of the contravention, be void."
        },
        {
          "ClauseNo": "3",
          "ClauseDesc": "In this article, unless the context otherwise requires,—",
          "SubClauses": [
            {
              "SubClauseNo": "a",
              "SubClauseDesc": "\"law\" includes any Ordinance, order, bye-law, rule, regulation, notification, custom or usage having in the territory of India the force of law;"
            },
            {
              "SubClauseNo": "b",
              "SubClauseDesc": "\"laws in force\" includes laws passed or made by a Legislature or other competent authority in the territory of India before the commencement of this Constitution and not previously repealed, notwithstanding that any such law or any part thereof may not be then in operation either at all or in particular areas."
            }
          ]
        },
        {
          "ClauseNo": "4",
          "ClauseDesc": "Nothing in this article shall apply to any amendment of this Constitution made under article 368."
        }
      ]
    },
    {
      "ArtNo": "14",
      "Name": "Equality before law.",
      "AKA":"Right to Equality",
      "ArtDesc": "The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India."
    },
    {
      "ArtNo": "15",
      "Name": "Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "No citizen shall, on grounds only of religion, race, caste, sex, place of birth or any of them, be subject to any disability, liability, restriction or condition with regard to—",
          "SubClauses": [
            {
              "SubClauseNo": "a",
              "SubClauseDesc": "access to shops, public restaurants, hotels and places of public entertainment; or"
            },
            {
              "SubClauseNo": "b",
              "SubClauseDesc": "the use of wells, tanks, bathing ghats, roads and places of public resort maintained wholly or partly out of State funds or dedicated to the use of the general public."
            }
          ]
        },
        {
          "ClauseNo": "3",
          "ClauseDesc": "Nothing in this article shall prevent the State from making any special provision for women and children."
        },
        {
          "ClauseNo": "4",
          "ClauseDesc": "Nothing in this article or in clause (2) of article 29 shall prevent the State from making any special provision for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes and the Scheduled Tribes"
        },
        {
          "ClauseNo": "5",
          "ClauseDesc": "Nothing in this article or in sub-clause (g) of clause (1) of article 19 shall prevent the State from making any special provision, by law, for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes or the Scheduled Tribes in so far as such special provisions relate to their admission to educational institutions including private educational institutions, whether aided or unaided by the State, other than the minority educational institutions referred to in clause (1) of article 30."
        },
        {
          "ClauseNo": "6",
          "ClauseDesc": "Nothing in this article or sub-clause (g) of clause (1) of article 19 or clause (2) of article 29 shall prevent the State from making,—",
          "SubClauses": [
            {
              "SubClauseNo": "a",
              "SubClauseDesc": "any special provision for the advancement of any economically weaker sections of citizens other than the classes mentioned in clauses (4) and (5); and"
            },
            {
              "SubClauseNo": "b",
              "SubClauseDesc": "any special provision for the advancement of any economically weaker sections of citizens other than the classes mentioned in clauses (4) and (5) in so far as such special provisions relate to their admission to educational institutions including private educational institutions, whether aided or unaided by the State, other than the minority educational institutions referred to in clause (1) of article 30, which in the case of reservation would be in addition to the existing reservations and subject to a maximum of ten per cent. of the total seats in each category."
            }
          ]
        }
      ],
      "Explanations": [
        {
          "ExplanationNo": "1",
          "Explanation": "For the purposes of this article and article 16, \"economically weaker sections\" shall be such as may be notified by the State from time to time on the basis of family income and other indicators of economic disadvantage."
        }
      ]
    },
    {
      "ArtNo": "16",
      "Name": "Equality of opportunity in matters of public employment.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect of, any employment or office under the State."
        },
        {
          "ClauseNo": "3",
          "ClauseDesc": "Nothing in this article shall prevent Parliament from making any law prescribing, in regard to a class or classes of employment or appointment to an office under the Government of, or any local or other authority within, a State or Union territory, any requirement as to residence within that State or Union territory prior to such employment or appointment."
        },
        {
          "ClauseNo": "4",
          "ClauseDesc": "Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favour of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State."
        },
        {
          "ClauseNo": "4A",
          "ClauseDesc": "Nothing in this article shall prevent the State from making any provision for reservation in matters of promotion, with consequential seniority, to any class or classes of posts in the services under the State in favour of the Scheduled Castes and the Scheduled Tribes which, in the opinion of the State, are not adequately represented in the services under the State."
        },
        {
          "ClauseNo": "4B",
          "ClauseDesc": "Nothing in this article shall prevent the State from considering any unfilled vacancies of a year which are reserved for being filled up in that year in accordance with any provision for reservation made under clause (4) or clause (4A) as a separate class of vacancies to be filled up in any succeeding year or years and such class of vacancies shall not be considered together with the vacancies of the year in which they are being filled up for determining the ceiling of fifty per cent. reservation on total number of vacancies of that year."
        },
        {
          "ClauseNo": "5",
          "ClauseDesc": "Nothing in this article shall affect the operation of any law which provides that the incumbent of an office in connection with the affairs of any religious or denominational institution or any member of the governing body thereof shall be a person professing a particular religion or belonging to a particular denomination."
        },
        {
          "ClauseNo": "6",
          "ClauseDesc": "Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favour of any economically weaker sections of citizens other than the classes mentioned in clause (4), in addition to the existing reservation and subject to a maximum of ten per cent. of the posts in each category."
        }
      ]  
    },
    {
      "ArtNo": "17",
      "Name": "Abolition of Untouchability.",
      "ArtDesc": "\"Untouchability\" is abolished and its practice in any form is forbidden. The enforcement of any disability arising out of “Untouchability” shall be an offence punishable in accordance with law."
    },
    {
      "ArtNo": "18",
      "Name": "Abolition of titles.",
      "Clauses": [
        {
          "ClauseNo": "1",
          "ClauseDesc": "No title, not being a military or academic distinction, shall be conferred by the State."
        },
        {
          "ClauseNo": "2",
          "ClauseDesc": "No citizen of India shall accept any title from any foreign State."
        },
        {
          "ClauseNo": "3",
          "ClauseDesc": "No person who is not a citizen of India shall, while he holds any office of profit or trust under the State, accept without the consent of the President any title from any foreign State."
        },
        {
          "ClauseNo": "4",
          "ClauseDesc": "No person holding any office of profit or trust under the State shall, without the consent of the President, accept any present, emolument, or office of any kind from or under any foreign State."
        }
      ]
    }
  ],
  [
    {
      "PartNo": "I",
      "Name": "THE UNION AND ITS TERRITORY",
      "Articles": ["1", "2", "2A", "3", "4"]
    },
    {
      "PartNo": "II",
      "Name": "CITIZENSHIP",
      "Articles": ["5", "6", "7", "8", "9", "10", "11"]
    },
    {
      
      "PartNo": "III",
      "Name": "FUNDAMENTAL RIGHTS",
      "Articles": ["12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "21A", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "31A", "31B", "31C", "31D", "32", "32A", "33", "34", "35"]
    }
  ]
]
